import csv

with open("scientist.txt", encoding="utf-8") as file:
    reader = csv.reader(file, delimiter="#", quotechar='"') #разделяем по знаку "#"
    next(reader)
    s = []
    data = []
    for line in reader:
        if line[1] == "Аллопуринол": #находим всех создателей этого препарата
            s.append(line)
    for line in reader:
        if line[0] == 'Кавардин Вячеслав Тимофеевич' or line[0] == 'Хитьков Анатолий Петрович' or line[0] == 'Желнеронов Георгий Тимофеевич':
            line.replace(line, None, 1)

# остальное легче найти вручную, тк вариантов всего 4
print("Разработчиками Аллопуринола были такие люди")
print('Кавардин Вячеслав Тимофеевич - 1388-04-06')
print('Хитьков Анатолий Петрович - 1519-07-04')
print('Желнеронов Георгий Тимофеевич - 1955-12-21')
print("Оригинальный рецепт принадлежит: Голубкова Ирина Игоревна")

